#include "gipool.h"

static const wchar_t* cynojokes[]=
{
     L"提瓦特哪个国家的建筑最不牢固？\0须弥，因为须弥墙危（须弥蔷薇）"
    ,L"夜兰手镯摔坏了应该找谁修？\0找琴团长，因为琴能补镯（勤能补拙）"
    ,L"为什么崩铁列车组不敢来提瓦特？\0因为提瓦特有托马，托马撕小火车（托马斯小火车）"
    ,L"甘雨小时候不会游泳，为什么掉到水里没事？\0因为甘雨小时候胖胖的，肥而不溺（腻）"
    ,L"为什么阿贝多老师成绩这么好？\0因为他是贝多分（贝多芬）"
    ,L"甘雨吃什么水果会马上消失？\0杨梅（羊没）"
    ,L"为什么不能握闲云的手？\0因为那个是仙人掌！"
    ,L"璃月人为什么都靠右走？\0因为帝君保右（保佑）"
    ,L"为什么大家都喜欢买璃月的快递？\0因为璃月有帝君包邮（保佑）"
    ,L"为什么迪卢克老爷这么有钱？\0因为他是“挣亿人”（正义人）"
    ,L"魈宝吃什么可以跳得很高？\0仙跳强（墙）"
    ,L"行秋写的诗歌要交给谁送到出版社？\0给公子，因为诗要鸭运（押韵）"
    ,L"荒泷一斗给谁画肖像画会很难看？\0芙宁娜，因为这是鬼画芙（鬼画符）"
    ,L"为什么那维莱特滋水的时候不消耗体力？\0因为滋滋不倦（孜孜不倦）"
    ,L"为什么那维莱特天赋叠满会发光？\0因为他是那维light"
    ,L"班尼特为什么不敢去枫丹？\0因为枫丹有刺霉会（刺玫会）"
    ,L"赛诺打了提纳里一下，为什么赛诺受伤了？\0因为打到反射狐了（反射弧）"
    ,L"雷神睡觉的时候害怕哪个角色？\0吓沃雷（夏沃蕾）"
    ,L"为什么美露莘要经常洗脖子？\0因为蓝脖积泥（兰博基尼）"
    ,L"为什么重云和申鹤不能坐同一条船\0因为有姨的小船说翻就翻"
    ,L"可莉炸飞了骗骗花，为什么被琴团长抓起来了？\0因为这是“炸骗”行为！"
    ,L"哪个角色最不适合说冷笑话？\0魈宝，因为魈话不凉（消化不良）"
    ,L"为什么艾尔海森打牌老是输？\0因为他是大“输”记官（大书记官）"
    ,L"莫娜最害怕哪个任务？\0黄金梦乡，因为那是杀莫书（沙漠书）"
    ,L"为什么大家都不敢和魈宝握手？\0因为那是仙人掌"
    ,L"为什么锅巴选了香菱做主人？\0因为她们俩投缘（头圆）"
    ,L"为什么芙宁娜和仆人一起走路会突然趴下？\0因为这是仆芙前进（匍匐前进）"
    ,L"心海看到谁会躲起来？\0温迪，因为他喜欢摸鱼"
    ,L"璃月人为什么不用种树？\0因为有仙人来栽（哉）"
    ,L"迪卢克和凯亚谁的腿比较长？\0迪卢克腿长，因为他是火系，火腿长（火腿肠）"
    ,L"阿贝多画哪个角色一笔就能完成？\0魈宝，因为一笔勾魈（销）"
    ,L"为什么公子背字母表只能背到AB？\0因为公子踩到迟滞之水了！还在等CD！（CD：技能冷却）"
    ,L"妮露沾了水为什么会变硬\0因为变成水泥路了（水妮露）"
    ,L"璃月人晚上看到谁容易饿？\0魈宝，因为晚上看到魈就是看到夜魈（夜宵）"
    ,L"提纳里和赛诺出去吃饭，一般是谁来买单？\0赛诺，因为诺诺大方（落落大方）"
    ,L"为什么赛诺考试总是拿满分？\0因为赛诺擅长“审”题，所以题目把答案都招了！"
    ,L"提瓦特哪个角色最不孤独？\0卡维，他是建筑师，有游标卡尺，游标卡尺不估读（孤独）"
    ,L"觉得赛诺说冷笑话很冷怎么办？\0去墙角，那里有90度"
    ,L"空哥和甘雨去便利店，为什么空哥被打了，甘雨没事\0因为便利店24小时不打羊（打烊）"
    ,L"为什么提瓦特没有蚊子？\0因为水神没了，只剩六个神了，六神（花露水）可以驱蚊"
    ,L"为什么冰系角色不怕赛诺讲冷笑话？\0因为冰美式（没事）"
    ,L"从前有一只鹿，是公的，它跑了起来，越跑越快，最后它变成了高速公鹿（路）"
    ,L"如果让荧妹“拍蒙”了派蒙，派蒙会变成什么？\0“荧击”食品"
    ,L"为什么说宵宫的爸爸也是花羽会的人？\0因为宵宫爸爸容易聋（绒翼龙）"
    ,L"杜林的一天为什么非常长？\0因为度（杜）日如年"
    ,L"请问杜林的家叫什么？\0杜甫（府）"
};

int cynoJoke(void)
{
    int index=0,current;
    const int jokeCount=(int)(sizeof(cynojokes)/sizeof(cynojokes[0]));
    srand((unsigned int)time(NULL));
    while(1) {
        const wchar_t* joke;
        const wchar_t* secondPart;
        CLS;
        index=rand()%jokeCount;
        joke=cynojokes[index];
        putws(joke);
        ENDL;
        secondPart=joke+wcslen(joke)+1;
        if(*secondPart!=L'\0') {
            puts(
#ifdef _WIN32
                "Press any key to see the answer..."
#else
                "Press ENTER to see the answer..."
#endif
            );
            PAUSE;
#ifdef _WIN32
            ENDL;
#endif
            putws(secondPart);
            ENDL;
        }
        puts(
#ifdef _WIN32
            "Press SPACE or ENTER to continue, or other thing to go back..."
#else
            "Press ENTER to continue, or type other key and then press ENTER to go back..."
#endif
        );
        ENDL;
        current=getch();
        if(current==EOF||
#ifdef _WIN32
            current==' '||
#endif
            current=='\r'||current=='\n') {
            continue;
        }
        break;
    }
    return 0;
}
