#ifndef CYNOJOKES
#define CYNOJOKES

#include "confunc.h"

const wchar_t *questions[][6]=
{
    // 1 ↓
    {L"提瓦特哪个国家的建筑最不牢固？\r",
     L"夜兰手镯摔坏了应该找谁修？\r",
     L"为什么崩铁列车组不敢来提瓦特？\r",
     L"甘雨小时候不会游泳，为什么掉到水里没事？\r",
     L"为什么阿贝多老师成绩这么好？\r",
     L"甘雨吃什么水果会马上消失？\r"
    },
    // 2 ↓
    {L"为什么不能握闲云的手？\r",
     L"璃月人为什么都靠右走？\r",
     L"为什么大家都喜欢买璃月的快递？\r",
     L"为什么迪卢克老爷这么有钱？\r",
     L"魈宝吃什么可以跳得很高？\r",
     L"行秋写的诗歌要交给谁送到出版社？\r"
    },
    // 3 ↓
    {L"荒泷一斗给谁画肖像画会很难看？\r",
     L"为什么那维莱特滋水的时候不消耗体力？\r",
     L"为什么那维莱特天赋叠满会发光？\r",
     L"班尼特为什么不敢去枫丹？\r",
     L"赛诺打了提纳里一下，为什么赛诺受伤了？\r",
     L"雷神睡觉的时候害怕哪个角色？\r"
    },
    // 4 ↓
    {L"为什么美露莘要经常洗脖子？\r",
     L"为什么重云和申鹤不能坐同一条船\r",
     L"可莉炸飞了骗骗花，为什么被琴团长抓起来了？\r",
     L"哪个角色最不适合说冷笑话？\r",
     L"为什么艾尔海森打牌老是输？\r",
     L"莫娜最害怕哪个任务？\r"
    },
    // 5 ↓
    {L"为什么大家都不敢和魈宝握手？\r",
     L"为什么锅巴选了香菱做主人？\r",
     L"为什么芙宁娜和仆人一起走路会突然趴下？\r",
     L"心海看到谁会躲起来？\r",
     L"璃月人为什么不用种树？\r",
     L"迪卢克和凯亚谁的腿比较长？\r"
    },
    // 6 ↓
    {L"阿贝多画哪个角色一笔就能完成？\r",
     L"为什么公子背字母表只能背到AB？\r",
     L"妮露沾了水为什么会变硬\r",
     L"璃月人晚上看到谁容易饿？\r",
     L"提纳里和赛诺出去吃饭，一般是谁来买单？\r"
    },
    // 7 ↓
    {L"为什么赛诺考试总是拿满分？\r",
     L"提瓦特哪个角色最不孤独？\r",
     L"觉得赛诺说冷笑话很冷怎么办？\r",
     L"空哥和甘雨去便利店，为什么空哥被打了，甘雨没事\r",
     L"为什么提瓦特没有蚊子？\r"
    } }
;

const wchar_t *answers[][6]=
{
    // 1 ↓
    {L"须弥，因为须弥墙危（须弥蔷薇）",
     L"找琴团长，因为琴能补镯（勤能补拙）",
     L"因为提瓦特有托马，托马撕小火车（托马斯小火车）",
     L"因为甘雨小时候胖胖的，肥而不溺（腻）",
     L"因为他是贝多分（贝多芬）",
     L"杨梅（羊没）"
    },
    // 2 ↓
    {L"因为那个是仙人掌！",
     L"因为帝君保右（保佑）",
     L"因为璃月有帝君包邮（保佑）",
     L"因为他是“挣亿人”（正义人）",
     L"仙跳强（墙）",
     L"给公子，因为诗要鸭运（押韵）"
    },
    // 3 ↓
    {L"芙宁娜，因为这是鬼画芙（鬼画符）",
     L"因为滋滋不倦（孜孜不倦）",
     L"因为他是那维light",
     L"因为枫丹有刺霉会（刺玫会）",
     L"因为打到反射狐了（反射弧）",
     L"吓沃雷（夏沃蕾）"
    },
    // 4 ↓
    {L"因为蓝脖积泥（兰博基尼）",
     L"因为有姨的小船说翻就翻",
     L"因为这是“炸骗”行为！",
     L"魈宝，因为魈话不凉（消化不良）",
     L"因为他是大“输”记官（大书记官）",
     L"黄金梦乡，因为那是杀莫书（沙漠书）",
    },
    // 5 ↓
    {L"因为那是仙人掌",
     L"因为她们俩投缘（头圆）",
     L"因为这是仆芙前进（匍匐前进）",
     L"温迪，因为他喜欢摸鱼",
     L"因为有仙人来栽（哉）",
     L"迪卢克腿长，因为他是火系，火腿长（火腿肠）"
    },
    // 6 ↓
    {L"魈宝，因为一笔勾魈（销）",
     L"因为公子踩到迟滞之水了！还在等CD！（CD：技能冷却）",
     L"因为变成水泥路了（水妮露）",
     L"魈宝，因为晚上看到魈就是看到夜魈（夜宵）",
     L"赛诺，因为诺诺大方（落落大方）",
    },
    // 7 ↓
    {L"因为赛诺擅长“审”题，所以题目把答案都招了！",
     L"卡维，他是建筑师，有游标卡尺，游标卡尺不估读（孤独）",
     L"去墙角，那里有90度",
     L"因为便利店24小时不打羊（打烊）",
     L"因为水神没了，只剩六个神了，六神（花露水）可以驱蚊"
    } }
;

int cynoJoke(void)
{
    int index1=0,index2=0;
    int current;
    while (1)
    {
        CLS;
        index1=rand()%7;
        index2=rand()%6;
        if (
            index1>=5&&index2==5
            )continue;
        putws(questions[index1][index2]);
        ENDL;
        if (questions[index1][index2][
            wcslen(
                questions[index1][index2])
                -1
        ]==L'\r'
            )
        {
            puts(
#ifdef _WIN32
                "Press any key to see the answer..."
#else
                "Press ENTER to see the answer..."
#endif
            );
            PAUSE;
        }
        ENDL;
        putws(answers[index1][index2]);
        ENDL;
        puts(
#ifdef _WIN32    
            "Press SPACE or ENTER to continue, or other thing to go back..."
#else
            "Press ENTER to continue, or type other key and then press ENTER to go back..."
#endif
        );
        ENDL;
        current=getch();
        if (
            current==EOF||
#ifdef _WIN32
            current==' '||
#endif
            current=='\r'||current=='\n'
            ) continue;
        else break;
    }
    return 0;
}

#endif