#include <stdbool.h>
#include <stdint.h>

typedef uint32_t RoleMeta;

#define VISION_OTHER   0
#define PYRO           1
#define HYDRO          2
#define ANEMO          3
#define ELECTRO        4
#define DENDRO         5
#define CRYO           6
#define GEO            7
#define VISION_UNKNOWN 8

#define ROLE_TYPE_TRAVELER_AETHER   0
#define ROLE_TYPE_TRAVELER_LUMINE   1
#define ROLE_TYPE_COLLAB            2
#define ROLE_TYPE_FOUR_STAR         4
#define ROLE_TYPE_LIMITED_FIVE_STAR 5
#define ROLE_TYPE_UNKNOWN           6
#define ROLE_TYPE_EXCLUDED          256
// 末两位均为 1 时，即模 4 余 3 时一律算作常驻五星

// 编码池信息（常驻五星时才有意义）
#define ENCODE_POOL_VERSION_FOR_PERMANENT_5_STAR(major,minor,half) \
    (((major)<<6)|(((minor)&0xF)<<2)|((half)&0x3))

// 构造 RoleMeta：常驻五星 = (encoded << 3) | 3（3表示常驻五星）
// 只看最后两位，如果是 3 ，表示是常驻五星，再去解码
// 如果往前全是 0 ，说明是开服常驻，从未 UP （刻晴是特殊情况）
#define MAKE_ROLE_META_P(major,minor,half) \
    ((ENCODE_POOL_VERSION_FOR_PERMANENT_5_STAR((major),(minor),(half))<<3)|3)

// 提取 roleType
#define GET_ROLE_TYPE(meta) ((meta)&0x7)

// 提取常驻五星的首次UP信息（前提是 GET_ROLE_TYPE(meta)==3）
#define GET_MAJOR_P(meta) (((meta)>>9)&0xFF)
#define GET_MINOR_P(meta) (((meta)>>5)&0x0F)
#define GET_HALF_P(meta)  (((meta)>>3)&0x03)

// 编码链表池信息 /
// （可能用不到，有可能链表卡池信息会用3个uint_8，不进行编码存放进uint_32，
// 因为反正链表为了存next指针需要是结构体了）
#define ENCODE_POOL_INFO_LL(major,minor,half)\
    (((major)<<24)|((minor)<<16)|((half)<<8))

// 提取链表池信息中的具体信息
#define GET_MAJOR_LL(meta) (((meta)>>24)&0xFF)
#define GET_MINOR_LL(meta) (((meta)>>16)&0xFF)
#define GET_HALF_LL(meta) (((meta)>>8)&0xFF)

typedef struct characterMap {
    const unsigned int id;
    const wchar_t name_cn[20];
    const char name[40];
    const uint8_t vision;
    const uint32_t attrib;
    /*
    0: traveler Aether
    1: traveler Lumine
    2: interaction such as Eloi
    3: permanent 5 star
    4: 4 star
    5: limited 5 star
    6: Unknown
    if mod 4 equals to 3 then it is permanent 5 star
    */
}Char_Map;

typedef struct weaponMap {
    const unsigned int id;
    const wchar_t name_cn[20];
    const char name[40];
    const unsigned int stars;
    const uint8_t type;
} WeaponMap;

typedef struct wishPool {
    unsigned int up5[24];
    unsigned int up4[24];
    unsigned int weapon[24];
    uint8_t major;
    uint8_t minor;
    uint8_t half;
    uint16_t startY;
    uint8_t startM;
    uint8_t startD;
    uint16_t endY;
    uint8_t endM;
    uint8_t endD;
} Wish_Pool;

typedef struct poolNode {
    uint8_t major;
    uint8_t minor;
    uint8_t half;
    struct poolNode* next;
}PoolNode,*PoolLinkList,**PoolLinkListArray;

Char_Map CharMap[]={
    {0,L"空","Aether",VISION_OTHER,0},
    {1,L"荧","Lumine",VISION_OTHER,1},
    {2,L"安柏","Amber",PYRO,4},
    {3,L"凯亚","Kaeya",CRYO,4},
    {4,L"丽莎","Lisa",ELECTRO,4},

    {5,L"芭芭拉","Barbara",HYDRO,4},
    {6,L"雷泽","Razor",ELECTRO,4},
    {7,L"香菱","Xiangling",PYRO,4},
    {8,L"北斗","Beidou",ELECTRO,4},
    {9,L"行秋","Xingqiu",HYDRO,4},
    {10,L"凝光","Ningguang",GEO,4},
    {11,L"菲谢尔","Fischl",ELECTRO,4},
    {12,L"班尼特","Bennett",PYRO,4},
    {13,L"诺艾尔","Noelle",GEO,4},
    {14,L"重云","Chongyun",CRYO,4},
    {15,L"砂糖","Sucrose",ANEMO,4},
    
    {16,L"琴","Jean",ANEMO,3},
    {17,L"迪卢克","Diluc",PYRO,3},
    {18,L"七七","Qiqi",CRYO,3},
    {19,L"莫娜","Mona",HYDRO,3},
    {20,L"刻晴","Keqing",ELECTRO,MAKE_ROLE_META_P(1,3,2)},

    {21,L"温迪","Venti",ANEMO,5},
    {22,L"可莉","Klee",PYRO,5},
    {23,L"迪奥娜","Diona",CRYO,4},
    {24,L"达达利亚","Tartaglia",HYDRO,5},
    {25,L"辛焱","Xinyan",PYRO,4},
    {26,L"钟离","Zhongli",GEO,5},
    {27,L"阿贝多","Albedo",GEO,5},
    {28,L"甘雨","Ganyu",CRYO,5},
    {29,L"魈","Xiao",ANEMO,5},
    {30,L"胡桃","Hutao",PYRO,5},
    {31,L"罗莎莉亚","Rosaria",CRYO,4},
    {32,L"烟绯","Yanfei",PYRO,4},
    {33,L"优菈","Eula",CRYO,5},
    {34,L"枫原万叶","Kaedehara Kazuha",ANEMO,5},
    {35,L"神里绫华","Kamisato Ayaka",CRYO,5},
    {36,L"早柚","Sayu",ANEMO,4},
    {37,L"宵宫","Yoimiya",PYRO,5},
    {38,L"埃洛伊","Eloi",HYDRO,2},
    {39,L"九条裟罗","Kujou Sara",ELECTRO,4},
    {40,L"雷电将军","Raiden Shogun",ELECTRO,5},
    {41,L"珊瑚宫心海","Sangonomiya Kokomi",HYDRO,5},
    {42,L"托马","Thoma",PYRO,4},
    {43,L"五郎","Gorou",GEO,4},
    {44,L"荒泷一斗","Arataki Itto",GEO,5},
    {45,L"云堇","Yunjin",GEO,4},
    {46,L"申鹤","Shenhe",CRYO,5},
    {47,L"八重神子","Yae Miko",ELECTRO,5},
    {48,L"神里绫人","Kamisato Ayato",HYDRO,5},
    {49,L"夜兰","Yelan",HYDRO,5},
    {50,L"久岐忍","Kuki Shinobu",ELECTRO,4},
    {51,L"鹿野院平藏","Shikanoin Heizou",ANEMO,4},
    {52,L"柯莱","Collei",DENDRO,4},
    {53,L"提纳里","Tighnari",DENDRO,MAKE_ROLE_META_P(3,0,1)},
    {54,L"多莉","Dori",ELECTRO,4},
    {55,L"坎蒂丝","Candace",HYDRO,4},
    {56,L"赛诺","Cyno",ELECTRO,5},
    {57,L"妮露","Nilou",HYDRO,5},
    {58,L"纳西妲","Nahida",DENDRO,5},
    {59,L"莱依拉","Layla",CRYO,4},
    {60,L"珐露珊","Faruzan",ANEMO,4},
    {61,L"流浪者","Wanderer",ANEMO,5},
    {62,L"瑶瑶","Yao Yao",DENDRO,4},
    {63,L"艾尔海森","Alhaitham",DENDRO,5},
    {64,L"迪希雅","Dehya",PYRO,MAKE_ROLE_META_P(3,5,1)},
    {65,L"米卡","Mika",CRYO,4},
    {66,L"卡维","Kaveh",DENDRO,4},
    {67,L"白术","Baizhu",DENDRO,5},
    {68,L"绮良良","Kirara",DENDRO,4},
    {69,L"琳妮特","Lynette",ANEMO,4},
    {70,L"林尼","Lyney",PYRO,5},
    {71,L"菲米尼","Freminet",CRYO,4},
    {72,L"那维莱特","Neuvillette",HYDRO,5},
    {73,L"莱欧斯利","Wriothesley",CRYO,5},
    {74,L"夏洛蒂","Charlotte",CRYO,4},
    {75,L"芙宁娜","Furina",HYDRO,5},
    {76,L"娜维娅","Navia",GEO,5},
    {77,L"夏沃蕾","Chevreuse",PYRO,4},
    {78,L"嘉明","Gaming",PYRO,4},
    {79,L"闲云","Xianyun",ANEMO,5},
    {80,L"千织","Chiori",GEO,5},
    {81,L"阿蕾奇诺","Arlecchino",PYRO,5},
    {82,L"赛索斯","Sethos",ELECTRO,4},
    {83,L"克洛琳德","Clorinde",ELECTRO,5},
    {84,L"希格雯","Sigewinne",HYDRO,5},
    {85,L"艾梅莉埃","Emilie",DENDRO,5},
    {86,L"卡齐娜","Kachina",GEO,4},
    {87,L"玛拉妮","Mualani",HYDRO,5},
    {88,L"基尼奇","Kinich",DENDRO,5},
    {89,L"希诺宁","Xilonen",GEO,5},
    {90,L"欧洛伦","Ororon",ELECTRO,4},
    {91,L"恰斯卡","Chasca",ANEMO,5},
    {92,L"茜特菈莉","Citlali",CRYO,5},
    {93,L"玛薇卡","Mavuika",PYRO,5},
    {94,L"蓝砚","Lan Yan",ANEMO,4},
    {95,L"梦见月瑞希","Yumemizuki Mizuki",ANEMO,MAKE_ROLE_META_P(5,4,1)},
    {96,L"伊安珊","Iansan",ELECTRO,4},
    {97,L"瓦雷莎","Varesa",ELECTRO,5},
    {98,L"伊法","Ifa",ANEMO,4},
    {99,L"爱可菲","Escoffier",CRYO,5},
    {100,L"塔利雅","Dahlia",HYDRO,4},
    {101,L"丝柯克","Skirk",CRYO,5},
    {102,L"伊涅芙","Ineffa",ELECTRO,5},
    {103,L"爱诺","Aino",HYDRO,4},
    {104,L"菈乌玛","Lauma",DENDRO,5},
    {105,L"菲林斯","Flins",ELECTRO,5},
    {106,L"奈芙尔","Nefer",DENDRO,5},
    {107,L"雅柯达","Jahoda",ANEMO,4},
    {108,L"杜林","Durin",PYRO,5},
    {109,L"叶洛亚","Illgua",GEO,4},
    {110,L"兹白","Zibai",GEO,5},
    {111,L"哥伦比娅·希珀塞莱尼娅","Columbina Hyposelenia",HYDRO,5},
    
};

Wish_Pool WishPool[]={
    {{21},{11,7,5},{0},1,0,1,2020,9,28,2020,10,18},
    {{22},{15,9,13},{0},1,0,2,2020,10,20,2020,11,10},
    {{24},{8,10,23},{0},1,1,1,2020,11,11,2020,12,1},
    {{26},{6,14,25},{0},1,1,2,2020,12,1,2020,12,22},
    {{27},{15,11,12},{0},1,2,1,2020,12,23,2021,01,12},
    {{28},{7,9,13},{0},1,2,2,2021,1,12,2021,2,2},
    {{29},{8,25,23},{0},1,3,1,2021,2,3,2021,2,17},
    {{20},{12,10,5},{0},1,3,2,2021,2,17,2021,3,2},
    {{30},{7,9,14},{0},1,3,3,2021,3,2,2021,3,16},
    {{21},{6,15,13},{0},1,4,1,2021,3,17,2021,4,6},
    {{24},{5,11,31},{0},1,4,2,2021,4,6,2021,4,27},
    {{26},{32,13,23},{0},1,5,1,2021,4,28,2021,5,18},
    {{33},{9,8,25},{0},1,5,2,2021,5,18,2021,6,8},
    {{22},{11,15,5},{0},1,6,1,2021,6,9,2021,6,29},
    {{34},{31,6,12},{0},1,6,2,2021,6,29,2021,7,20},
    {{35},{14,10,32},{0},2,0,1,2021,7,21,2021,8,10},
    {{37},{23,36,25},{0},2,0,2,2021,8,10,2021,8,31},
    {{40},{39,15,7},{0},2,1,1,2021,9,1,2021,9,21},
    {{41},{31,8,9},{0},2,1,2,2021,9,21,2021,10,12},
    {{24},{14,10,32},{0},2,2,1,2021,10,23,2021,11,02},
    {{30},{42,36,23},{0},2,2,2,2021,11,02,2021,11,23},
    {{27},{31,13,12},{0},2,3,1,2021,11,24,2021,12,14},
    {{33},{5,43,7},{0},2,3,2,2021,12,14,2022,1,4},
    {{46,29},{45,10,14},{0},2,4,1,2022,1,5,2022,1,25},
    {{26,28},{9,8,32},{0},2,4,2,2022,1,25,2022,2,15},
    {{47},{42,11,23},{0},2,5,1,2022,2,16,2022,3,8},
    {{40,41},{39,25,12},{0},2,5,2,2022,3,8,2022,3,29},
    {{48,21},{45,15,7},{0},2,6,1,2022,3,30,2022,4,19},
    {{35},{36,31,6},{0},2,6,2,2022,4,19,2022,5,31},
    {{49,29},{5,13,32},{0},2,7,1,2022,5,31,2022,6,21},
    {{44},{50,43,14},{0},2,7,2,2022,6,21,2022,7,12},
    {{34,22},{51,42,10},{0},2,8,1,2022,7,13,2022,8,2},
    {{37},{45,25,12},{0},2,8,2,2022,8,2,2022,8,23},
    {{53,26},{52,23,11},{0},3,0,1,2022,8,24,2022,9,9},
    {{41,28},{54,15,9},{0},3,0,2,2022,9,9,2022,9,27},
    {{56,21},{50,55,36},{0},3,1,1,2022,9,28,2022,10,14},
    {{57,27},{5,8,7},{0},3,1,2,2022,10,14,2022,11,1},
    {{58,37},{13,6,12},{0},3,2,1,2022,11,2,2022,11,18},
    {{47,24},{59,51,42},{0},3,2,2,2022,11,18,2022,12,6},
    {{61,44},{60,43,32},{0},3,3,1,2022,12,7,2022,12,27},
    {{40,48},{39,31,36},{0},3,3,2,2022,12,27,2023,1,17},
    {{63,29},{62,45,25},{0},3,4,1,2023,1,18,2023,2,7},
    {{30,49},{9,10,8},{0},3,4,2,2023,2,7,2023,2,28},
    {{64,56},{5,52,12},{0},3,5,1,2023,3,1,2023,3,21},
    {{35,46},{65,15,23},{0},3,5,2,2023,3,21,2023,4,11},
    {{58,57},{50,59,54},{0},3,6,1,2023,4,12,2023,5,2},
    {{67,28},{66,55,11},{0},3,6,2,2023,5,2,2023,5,23},
    {{37,47},{68,45,14},{0},3,7,1,2023,5,24,2023,6,13},
    {{34,63},{62,51,7},{0},3,7,2,2023,6,13,2023,7,4},
    {{33,22},{65,42,6},{0},3,8,1,2023,7,5,2023,7,25},
    {{41,61},{60,31,32},{0},3,8,2,2023,7,25,2023,8,15},
    {{70,49},{69,5,12},{0},4,0,1,2023,8,16,2023,9,5},
    {{26,24},{71,36,13},{0},4,0,2,2023,9,5,2023,9,26},
    {{72,30},{9,11,23},{0},4,1,1,2023,9,27,2023,10,17},
    {{73,21},{54,42,14},{0},4,1,2,2023,10,17,2023,11,7},
    {{75,67},{74,52,8},{0},4,2,1,2023,11,8,2023,11,28},
    {{56,48},{68,50,7},{0},4,2,2,2023,11,28,2023,12,19},
    {{76,35},{15,31,55},{0},4,3,1,2023,12,20,2024,1,9},
    {{40,37},{77,39,12},{0},4,3,2,2024,1,9,2024,1,30},
    {{79,58},{78,60,13},{0},4,4,1,2024,1,31,2024,2,20},
    {{47,29},{62,10,25},{0},4,4,2,2024,2,20,2024,3,12},
    {{80,44},{54,42,45},{0},4,5,1,2024,3,13,2024,4,2},
    {{33,19,27,22,17,16},{0},{0},4,5,11,2024,3,13,2024,4,2},
    {{72,34},{5,9,32},{0},4,5,2,2024,4,2,2024,4,23},
    {{81,70},{69,71,7},{0},4,6,1,2024,4,24,2024,5,14},
    {{67,61},{59,60,8},{0},4,6,2,2024,5,14,2024,6,4},
    {{83,63},{82,42,12},{0},4,7,1,2024,6,5,2024,6,25},
    {{84,75},{78,31,13},{0},4,7,2,2024,6,25,2024,7,16},
    {{76,57},{68,66,10},{0},4,8,1,2024,7,17,2024,8,6},
    {{85,49},{32,7,6},{0},4,8,2,2024,8,6,2024,8,27},
    {{87,34},{86,25,12},{0},5,0,1,2024,8,28,2024,9,17},
    {{88,40},{42,39,77},{0},5,0,2,2024,9,17,2024,10,8},
    {{89,80},{54,55,52},{0},5,1,1,2024,10,9,2024,10,29},
    {{58,30},{82,9,50},{0},5,1,2,2024,10,29,2024,11,19},
    {{91,70},{90,15,5},{0},5,2,1,2024,11,20,2024,12,10},
    {{72,26},{51,11,62},{0},5,2,2,2024,12,10,2024,12,31},
    {{93,92},{86,23,12},{0},5,3,1,2025,1,1,2025,1,21},
    {{81,83},{94,74,24},{0},5,3,2,2025,1,21,2025,2,11},
    {{67,46,20,28,18,24,29},{0},{0},5,3,12,2025,1,21,2025,2,11},
    {{95,84},{43,7,36},{0},5,4,1,2025,2,12,2025,3,4},
    {{75,73},{74,14,65},{0},5,4,2,2025,3,4,2025,3,25},
    {{97,79},{96,77,78},{0},5,5,1,2025,3,26,2025,4,15},
    {{89,21},{60,32,8},{0},5,5,2,2025,4,15,2025,5,6},
    {{99,76},{98,90,59},{0},5,6,1,2025,5,7,2025,5,27},
    {{88,40},{42,39,69},{0},5,6,2,2025,5,27,2025,6,17},
    {{35,48,37,80,47,44,41,34},{0},{0},5,6,12,2025,5,27,2025,6,17},
    {{101,46},{100,55,23},{0},5,7,1,2025,6,18,2025,7,8},
    {{93,85},{62,7,96},{0},5,7,2,2025,7,8,2025,7,29},
    {{102,92},{82,11,9},{0},5,8,1,2025,7,30,2025,8,19},
    {{87,91},{98,90,12},{0},5,8,2,2025,8,19,2025,9,9},
    {{104,58},{66,50,5},{0},6,0,1,2025,9,10,2025,9,30},
    {{64,63,61,56,57,53},{0},{0},6,0,11,2025,9,10,2025,9,30},
    {{105,49},{103,15,54},{0},6,0,2,2025,9,30,2025,10,21},
    {{106,75},{62,9,52},{0},6,1,1,2025,10,22,2025,11,11},
    {{81,26},{94,45,31},{0},6,1,2,2025,11,11,2025,12,02},
    {{108,21},{107,60,12},{0},6,2,1,2025,12,03,2025,12,23},
    {{97,89},{96,77,78},{0},6,2,2,2025,12,23,2026,1,13},
    {{111,102},{98,82,11},{0},6,3,1,2026,1,14,2026,2,3}/*,
    */
};